app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
    def index
        restaurant = Restaurant.all

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def show
        begin
        id = params[:id]
        restaurant = Restaurant.find(id)

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 9]]
---
    def destroy
        begin
          restaurant = Restaurant.find(params[:id])
          restaurant.destroy